import pandas as pd# Импортируем библиотеку pandas для работы с таблицами (DataFrame)
import numpy as np

df = pd.DataFrame(columns=["ФИО", "Адрес", "Телефон", "Дата рождения"])# Создаем пустую таблицу с четырьмя колонками: ФИО, Адрес, Телефон и Дата рождения

while True: # Запускаем бесконечный цикл, чтобы программа работала, пока мы сами не выберем выход
    print("\n1-Показать, 2-Добавить, 3-Удалить, 4-Изменить, 5-Выход") # Выводим на экран меню доступных действий
    b = input("Действие: ")  # Просим пользователя ввести цифру от 1 до 5 и сохраняем её в переменную b

    if b == "1": # Если пользователь ввёл "1" (Показать):
        print(df)  # Выводим текущую таблицу на экран в консоль

    elif b == "2":  # Если пользователь ввёл "2" (Добавить):
       
        df.loc[len(df)] = [
             input("ФИО: "),  # Запрашиваем ФИО и записываем в первую колонку
            input("Адрес: "),  # Запрашиваем Адрес и записываем во вторую колонку
            input("Телефон: "),  # Запрашиваем Телефон и записываем в третью колонку
            input("Дата рождения: "),  # Запрашиваем Дата рождения и записываем в четвертую колонку
        ]

    elif b == "3":  # Если пользователь ввёл "3" (Удалить):
        c = int(input("Индекс для удаления: "))  # Просим ввести номер строки, превращаем текст в число и сохраняем в c
        df = df.drop(c).reset_index(drop=True)  # Удаляем строку с индексом c и пересоздаем индексы заново, чтобы не было пропусков

    elif b == "4":# Если пользователь ввёл "4" (Изменить):
        c = int(input("Индекс строки: "))  # Просим ввести номер строки (нужно вводить ЦИФРУ, иначе программа выдаст  ошибку)
        d = input("Какое поле менять (ФИО/Адрес/Телефон/Дата рождения): ") # Просим ввести точное название колонки, которую хотим изменить
        df.at[c, d] = input("Новое значение: ") # Запрашиваем новый текст и перезаписываем ячейку на пересечении строки c и колонки d
    elif b == "5":# Если пользователь ввёл "5" (Выход):
        break # Выходим из бесконечного цикла while, что приводит к завершению работы программы












 