import numpy as np  # Подключаем библиотеку NumPy для работы с матрицами

n = int(input("Введите n: "))  # Запрашиваем количество строк 
m = int(input("Введите m: "))  # Запрашиваем количество столбцов 

a = np.random.randint(1, 10, size=(n, m))  # Создаем матрицу 'a' размера N на M из случайных чисел от 1 до 9
print(a)  # Выводим исходную матрицу 'a' в консоль

b = a.T  # Транспонируем матрицу 'a' (меняем строки и столбцы местами) и сохраняем в 'b'
print(b)  # Выводим полученную транспонированную матрицу 'b' в консоль

if n != m:  # Проверяем, если количество строк не равно количеству столбцов
    print("Не квадратная")  # Печатаем, что матрица не квадратная (для нее нельзя найти определитель)
else:  # Если матрица квадратная (n равно m), то выполняем код ниже
    x = round(np.linalg.det(a))  # Считаем определитель матрицы 'a' и округляем его до целого числа
    y = round(np.linalg.det(b))  # Считаем определитель матрицы 'b' и округляем его до целого числа
    print(x)  # Выводим в консоль значение определителя исходной матрицы
    print(y)  # Выводим в консоль значение определителя транспонированной матрицы
    print(x == y)  # Сравниваем определители и выводим True (если равны) или False (если нет)